# page_components/stories/dog_stories.py
CAT_STORIES = {
    "abby": {
        "en": """
<b>Abby</b> hi.
""",
        "zh": """
<b>Abby</b> Abby是家里的大姐，她14岁了，是一只长毛重点色暹罗。能感觉到她已经很老了，抱起来都是空心的特别轻......Abby很讨厌她的弟弟Bruce，每次我在摸着Abby的时候，Bruce这个大醋王就会一头撞过来把Abby姐挤开，然后Abby就会哈Bruce。经常半夜会听到Abby哈Bruce的声音，八成又是Bruce在骚扰人家啊比了。
            Abby有一只耳朵是耷拉下来的，每次看她她都感觉好委屈。Abby和小妹Mimi的关系倒是不错，她俩可以凑的近近的也不打架不哈气。估计Abby年纪到了看猫看的很透彻，一下就看出Bruce不是什么好猫哈哈哈哈所以每次他一接近，啊比都直接走开

"""
    },
    "Athena": {
        "en": """
<b>Athena</b> hi.
""",
        "zh": """
<b>Athena</b> Athena是一只西森，她和她的好弟弟Dobby吉娃娃一起来寄养的。他们的主人是Pomona大学的教授，好像是教biochem还是什么的有点不记得了。她好像只来了大概5天吧，有3天都是躲在床底的，也不愿意出来。不过第四天就愿意出来然后蹭我了！确实是这样的，很多年纪大一点的猫猫来到新环境都不是很愿意社交。
虽然Athena和Dobby都在一个屋檐下生活，但是他俩倒是谁也不搭理谁，都在干自己的事情。
            Athena的毛特别多特别炸，不过手感一般，有点儿粗糙，不是特别顺滑的那种。
"""
    },
    "Bella": {
        "en": """
<b>Bella</b> hi.
""",
        "zh": """
<b>Bella</b> Bella来的时间特别特别短，短到不可置信，一共来了8小时不到。所以真的没有几张照片能放上来。。。主要原因是因为主人的公寓今天不知道会修什么，说警报会一直响，她怕Bella会应激（毕竟已经十多岁了），所以白天先送过来，然后下班了接走。
            贝拉给我的第一印象是挺漂亮的大三花。不过美国人真的养的挺糙的，Bella身上有一个巨大无比的毛结，我不知道该怎么形容，大概就是光抓着这个毛结都能把bella拎起来的这么大的程度。如果不用剪刀剪掉估计就是根本不可能梳顺。

"""
    },
    "Boba": {
        "en": """
<b>Boba</b> hi.
""",
        "zh": """
<b>Boba</b> hi
"""
    },
    "Bruce": {
        "en": """
<b>Bruce</b> hi.
""",
        "zh": """
<b>Bruce</b> 说实话Bruce Mimi Abby这三个活宝里面我最最最想念的就是Bruce了。他全名叫Bruce
            Wayne，是一只短毛紫色重点暹罗。他和Mimi是一窝的不过体型可比Mimi大的太多了，一个原因可能是因为他是公猫，另一个原因可能就是他经常霸凌Mimi把人家的饭都吃了。
            Bruce很粘人，是那种一叫他他就嗷嗷嗷过来找你的，一到早上看你没醒会拿头撞你的小猫。因为没什么毛，那个大脑袋撞起人来格外的疼。
            他也是很喜欢争宠，每次摸着别的猫的时候他都要过来把人家挤走。
            然后也经常抓到他霸凌Mimi，把人家骑在下面用脚踹。
"""
    },
    "Bubble": {
        "en": """
<b>Bubble</b> hi.
""",
        "zh": """
<b>Bubble</b> Bubble和他的好兄弟Rocket一起来到我家要寄养5个多月因为他们的主人回国了～八宝真的是个特别特别乖的宝宝，他是一只美短，和粥粥的花纹超像！不过体型倒是小了一倍。
            八宝有一个小习惯就是每次见到我或者别的小猫，都喜欢把鼻子凑过来闻闻闻，闻得超使劲儿，然后才一脸满足地走开。他和Rocket真的是超级无敌和睦，经常看到他们两个互相舔毛，你舔完我舔，我舔完你舔。
            Bubble胆子也是很大，第一天的时候就到处乱窜了，根本不会躲起来。而且还会主动找人玩，经常会听到他嗷嗷叫在家里找人。

"""
    },
    "Chewy": {
        "en": """
<b>Chewy</b> hi.
""",
        "zh": """
<b>Chewy</b> hi
"""
    },
    "Clarice": {
        "en": """
<b>Clarice</b> hi.
""",
        "zh": """
<b>Clarice</b> Clarice是一只长毛三花女孩儿，来的时间很短，算是一个daycare吧。她的主人主要是想测试一下去到新环境Clarice会不会应激会不会有什么特别的反应，因为他们准备要去长途旅行打算带上Clarice。
            不负众望！Clarice出了猫包就开始到处探索，也没有要躲起来，也没有害怕。看来之后去旅行也会很好地适应啦～

"""
    },
    "Delia": {
        "en": """
<b>Delia</b> hi.
""",
        "zh": """
<b>Delia</b> Delia 是我Rover上第二个上门喂养的单子，当时单子不多有我就接。其实有点儿后悔，因为她主人本来设定的地址是在我家附近，不过她好像搬家了，新家离我家其实蛮远的，来回要一个多小时。
            Delia性格特别特别好，人来亲。不过爪子也是特别特别尖，尖到轻轻吧啦一下我就能直接划拉一个口子那种。每次去都会不小心被划一道.....她也不是故意的，就是她喜欢踩过来蹭我，一过来就会划到我，我也是没有别的办法。

"""
    },
    "Dio": {
        "en": """
<b>Dio</b> hi.
""",
        "zh": """
<b>Dio</b> 很特别，是一只哮喘小猫。他长得很喜感，很像有小胡子的日本人哈哈哈哈。我还是第一次给小猫吸哮喘药呢，其实就是人的哮喘喷雾，挤一泵然后对着他的鼻子嘴，看着他呼吸10次就差不多是一个疗程。每天晚上都要给他吸药。
            好在Dio吸药的时候是蛮配合的，我都能抓到他。别的时候他东躲西藏的，根本摸不到。还经常把自己藏进被子里面，漏一个头出来看着我。

"""
    },
    "Django": {
        "en": """
<b>Django</b> hi.
""",
        "zh": """
<b>Django</b>是我带过的黑猫里面最不凶的。也不知道为什么基本上歪果仁的黑猫都凶凶的....之前有带过一只猫包没开就炸毛，我真的很害怕他会应激，我也有做好措施在房间喷calming喷雾，不过还是得用工具撬开猫包我出房间让他自己出来熟悉熟悉。
    Django 相对而言是很淡定的黑猫，我会给他用ipad播猫片看，也不知道他有没有看进去，反正就安安静静地坐在ipad前面。他平时很喜欢看着窗外，画面很唯美，不过手机实在是拍不出来因为他太黑了。

"""
    },
    "Draco": {
        "en": """
<b>Draco</b> hi.
""",
        "zh": """
<b>Draco</b>来自一个一家三口，家里有三花妹妹Indigo和吉娃娃Migo。Draco是一只典型的黑猫，刚来的时候跟他不熟他就凶巴巴的不让抱。不过好在他还是蛮好贿赂的，多喂几次猫条他就直接跟我走了哈哈哈。
            感觉抓扣不怎么喜欢自己的妹妹，妹妹一靠近就哈她.....盲猜家长没有做好introduction。他们一家来了好几次了，不过每次走的时候抓Draco回猫包还是挺费劲儿的，需要用很多小技巧引诱他进去，硬来他肯定会生气。

"""
    },
    "Gigi": {
        "en": """
<b>Gigi</b> hi.
""",
        "zh": """
<b>Gigi</b> 是一只漂亮的蓝眼睛银渐层姐姐，有很多眼屎哈哈哈。听她的主人说，以前没有弟弟tobi的时候姐姐还是很粘人的。自从有一次主人回国了之后，姐姐就变得不咋粘人了，然后有了tobi之后姐姐就更独立了。
            不过姐姐还是很好哄的，对人类的食物感兴趣。每次我喝牛奶的时候都要凑过来看一看闻一闻，我觉得我如果不看着的话，她的手估计就要伸进去了。刚来的时候姐姐喜欢钻在被窝里面，探出头偷偷看我。虽然有了二胎，姐姐倒也没有很讨厌弟弟，不会欺负他，最多就拉拉个脸。吃饭的时候也可以和弟弟头贴着头一起吃，不过我倒是没有见到他们关系好到互相舔毛。

"""
    },
    "Indigo": {
        "en": """
<b>Indigo</b> hi.
""",
        "zh": """
<b>Indigo</b> 是一只6个月的小三花，不过她真的好瘦，不像是6个月大的。她对什么都很好奇，一来就开始探索新地图。而且很友好！随便抱随便摸，就是指甲超级无敌尖。
            Indigo超喜欢玩橡皮筋，而且她会巡回！！作为一个为数不多会巡回的小猫，她真的是很聪明了。我特别喜欢把皮筋儿给她弹老远，然后她就会追着跑。Indigo经常被自己的老大哥Draco霸凌，比如说两个人一起玩逗猫棒的时候，如果indigo抢到了，draco就会凶她......不提倡，但是也没办法。

"""
    },
    "Ivy": {
        "en": """
<b>Ivy</b> hi.
""",
        "zh": """
<b>Ivy</b> 是家里的白雪公主，她有4只狗哥哥！！不过她的哥哥们没有来boarding哈哈哈，只有她来了。她的主人说想让她多出来社交一下，见见别的小猫咪。不负众望！她来的时候有好多只小猫咪陪她玩，还有猫咪友好的小狗。
            Ivy是一只shelter领养的小灰猫咪，跟谁都能处很好，特别是和我们的大Tora，他们可以玩成一片。Ivy还很喜欢跑去厕所偷偷喝厕所水，被我逮到好几次，于是我就把厕所门给关起来了哈哈哈。

"""
    },
    "Joey": {
        "en": """
<b>Joey</b> hi.
""",
        "zh": """
<b>Joey</b> hi
"""
    },
    "Lily": {
        "en": """
<b>Lily</b> hi.
""",
        "zh": """
<b>Lily</b> 是Noel的亲生姐姐，和Noel同一窝然后一起被领养了出来～他俩简直就是一个模子刻出来的，有很多角度Lily跟Noel真的就是一摸一样！一样一样的胆子小小的，不过Lily更加胆小得离谱。
            Lily在我这里待了整整一个月，一个月了都还是不敢出房间，每次我逗她出来然后把房间门关上，她就会一直扒门扒门告诉我她要回她的舒适区。有时候我会把Tora姐姐放进去陪她，然后Tora也不干别的，就会kuku把Lily的饭干完......Tora之前其实也和Lily见过一面，因为她们的小主人是好朋友！

"""
    },
    "Mars": {
        "en": """
<b>Mars</b> hi.
""",
        "zh": """
<b>Mars</b> 是一只领养回来的小橘！我觉得他很有成为大橘的潜力因为给他什么他都能吃完然后吃炒鸡香，这次回去了长大了足足一圈。
            小Mars有很多小癖好，比如说喜欢趴在我的肩上我带着他到处晃悠，弯下腰的时候他肯定会跳到我的背上，所以得经常给他剪指甲以防误伤哈哈哈啊哈～
            小Mars的主人寒假回国了，本来是想带Mars一起回去的不过着急忙慌的手续也没有办好，只能先拜托我照顾一下他然后下次再带回去啦。Mars的小主人真的特别特别客气，接猫猫的时候给我准备了很多小礼物，送走猫猫的时候又给我带了很多小礼物！真的是超级超级超级客气！

"""
    },
    "Marty": {
        "en": """
<b>Marty</b> hi.
""",
        "zh": """
<b>Marty</b> 来的时候主人慌慌张张的，跟我说他们在搬家，Marty经常往外跑弄的脏兮兮的，他们也怕他丢了就扔到我这里了。他们还说我可以帮马蹄洗澡🛀，于是一送来我就给他洗了个香香的澡。Marty比我想象中的配合，除了一边洗一边骂骂咧咧之外，也没有反抗也没有逃跑。
            洗完澡的时候我们发现Marty身上挺多新伤口的，估计是遛出门的时候和别人打架打的。在家的Marty还是很乖的，他喜欢躺在毯子上睡觉，然后想出门的时候会对着我们喵喵叫，说他想出去。
            Marty算是来的时候最匆忙的小猫了，他什么都没带，就带了个猫包。实话说，我也有点担心他被弃养了，因为实在是有点儿太仓促了。他主人说他吃什么都行，他不挑。

"""
    },
    "Melody": {
        "en": """
<b>Melody</b> hi.
""",
        "zh": """
<b>Melody</b> 是一只shelter领养的小小猫！亲人亲到不行，见不到人就会喵喵叫找人。她和别的小猫也可以玩很好。她最喜欢睡觉的地方是我的洗衣篮......经常睡的我的衣服都是毛哈哈哈哈。
            她真的好可爱好可爱，叫起来也是嗲嗲的。我真的好喜欢接猫baby，让我想起来我家里两只的小时候。Melody可尊贵了，没一顿都是罐头，来的时候他的主人带了一整个背包的罐头。
            家里的小弟Gogo对这个小女孩特别感兴趣，经常觊觎她的美貌然后骚扰人家。平时二弟都不喜欢搭理小母猫，这次真的是和铁树开花了。

"""
    },
    "Mia": {
        "en": """
<b>Mia</b> hi.
""",
        "zh": """
<b>Mia</b> hi
"""
    },
    "Milo1": {
        "en": """
<b>Milo</b> hi.
""",
        "zh": """
<b>Milo</b> 只来了短短两天，好像也是因为主人公寓要装修。第一天的时候Milo闻到家里有别的小猫的味道就特别特别凶，我一过去他就哈我。我都有点不敢在他面前走动，因为我移动他就哈，然后还有可能扑过来抓我的脚。
他的主人说他确实是第一次寄养，不过平时在家都是何人贴贴的那种小猫。Milo第一天基本上就是钻到柜子底下，不过他也不是完全藏起来，他就喜欢漏半个身子在外面然后看着哦我。
            晚上的时候他好很多了，直接在床上劈叉，非要跟我睡一起。不过还是不让我摸他，摸他就生气。
            第二天的时候Milo就完全不怕我了，我在办公的时候他居然光明正大的跳到桌子上拱我的电脑，然后把大脑袋凑过来要我摸他。

"""
    },
    "Mimi": {
        "en": """
<b>Mimi</b> hi.
""",
        "zh": """
<b>Mimi</b> 是家里的小妹，Bruce同卵双胞胎。不过她的颜色比Bruce深好多。他们仨的主人是一个日本老头医生，当初他在Rover预定我的时候我都还以为他是scam，因为他一开口就是讲这三只猫的来历和故事，根本没有提别的。
我们Meet and Greet的时候约在了家里旁边的星巴克，
            老头拿着两个大航空箱装着Bruce和Mimi。他对他的小猫特别骄傲，坐了一个小时全在说他们仨的故事，然后他们名字的来历等等。能看得出他很爱他们。
                        老头很老派，给我付钱都是让银行寄支票，一个月每个星期一寄一次，因为他不会用zelle。他这个月好像去了欧洲，他还把他的行程表发给我，每天有几个小时时差也发给我，真的整了很多没有用的哈哈哈哈。他家三个宝贝来的时候真的阵仗很大，整个家都要搬过来了！！


"""
    },
    "Moomoo": {
        "en": """
<b>Moomoo</b> hi.
""",
        "zh": """
<b>Moomoo</b> Moomoo是一只十岁还是十几岁的猫猫老人了。
            他的主人回台湾了一个多月，就让我帮忙上门喂喂他。他们家离我家蛮近的所以一周去四次。Moomoo以前尿闭过，所以我每次去都会给他喂半个利尿罐头。不过后来主人说他又长胖了就把罐头减少到1/4一次。
                        每次去的时候moomoo都像八百年没见到人一样，一听到车库门打开，他就在家门口蹲着等我。我一坐下他就疯狂拿他的大头蹭我，正好那会儿也是掉毛季，我每次黑裤子来白裤子走。
            Moomoo有个怪癖，每次摸他摸到正爽，他会突然给我来一口，虽然不会真的咬出血，但是还是够疼的。

"""
    },
    "Nacho": {
        "en": """
<b>Nacho</b> hi.
""",
        "zh": """
<b>Nacho</b> 如其名是黄色小橘猫。他比妹妹oreo活泼大胆很多，出了猫包之后就开始捣乱！喜欢把桌子上的东西拨下去，然后抓我的小窗帘。他们两个还成为了Noel哥哥的小跟屁虫，喜欢在床上跟Noel玩。
            Noel变成了孩子王，还有时候会偷吃弟弟妹妹的罐头哈哈哈哈。他们主人说Nacho在家都是欺负Oreo的，可是在我这里我发现明明就是Oreo追着Nacho跑，两只小猫每天都鸡飞狗跳的。
            这两只活宝的主人好像是去了夏威夷度假，她时不时的还给我发好多夏威夷的照片。回来接他俩的时候说他们长大了好多，小猫就是长得快呀，一个星期一个样。

"""
    },
    "Noel": {
        "en": """
<b>Noel</b> hi.
""",
        "zh": """
<b>Noel</b> 是领养的小猫咪！他有一只一窝的姐姐Lily，都被Noel主人和她的朋友一起带回了家。Noel来的第一天在柜子底下躲了整个白天，晚上灯一关他就鬼鬼祟祟出来拉粑粑吃饭。有点没想到的是，第一晚的半夜他突然在我床上喵喵喵叫，叫了很久，一边叫还一边扒拉我。
Noel来了蛮久的，两个多月，期间和家里的Jojo
            Gogo可谓是玩成一片，很好的融入了大家庭。在大厅一起吃饭拉屎吃零食。还拍了很多超可爱的照片！他们处得挺好的，不过突然有一天他压力上来了开始尿闭.....然后就被隔离开吃了好多天的利尿罐头和药，走之前痊愈了。
"""
    },
    "Nyxey": {
        "en": """
<b>Nyxey</b> hi.
""",
        "zh": """
<b>Nyxey</b> 也是一只上门喂养的小小猫，她被主人养在了主卧房间因为她真的太小了房子太大经常找不到她在哪儿，主卧的衣柜被做成了小猫乐园。
第一次Meet and greet的时候，Nyxey走在二楼楼梯把手上，摇摇欲坠。
            我们都提心吊胆的，结果还没来得及去拯救她，她就摔下来了。好在猫有九条命，Nyxey拍拍屁股没事猫一样就走了。
            Nyxey是在一个4宠家庭。她上面有三只狗狗哥姐。我这次去上门的时候大哥跟着去旅游了，剩下她和两只姐姐在家里。每次我去房间看Nyxey的时候她都没有躲着，又会来迎接我。

"""
    },
    "Oreo": {
        "en": """
<b>Oreo</b> hi.
""",
        "zh": """
<b>Oreo</b> 是白色的那只小奶猫，美国人取名字都挺直白的，她的哥哥Nacho就是另一只小橘猫。她的主人跟我说他们是在院子里捡到的，见到的时候见不到猫妈妈，只有两只小宝宝。于是他们就把它们带回家收养了。他们真的是我带过年纪最小的小猫了！才两个月大。
小猫真的就是精力无限，所以他们的主人给他们准备了playpen，跟我说晚上可以把他们俩放进去。一开始我还打算晚上让他们在房间自由活动，结果还是失策了，他们主人想的太周到了。
            这两个小登西，晚上不睡觉，上蹿下跳的跑酷。睡觉5分钟，玩闹2小时。奥利奥刚来的时候非常害羞，我伸手去抱她她还会哈我，不过是无效哈气，我还是抱到了。
"""
    },
    "Pico": {
        "en": """
<b>Pico</b> hi.
""",
        "zh": """
<b>Pico</b> hi
"""
    },
    "Pika": {
        "en": """
<b>Pika</b> hi.
""",
        "zh": """
<b>Pika</b> hi
"""
    },
    "Riceball": {
        "en": """
<b>Riceball</b> hi.
""",
        "zh": """
<b>Riceball</b>是奶茶主人朋友的小猫，这次她俩一块儿出去玩就把奶茶和riceball一起放到了我这边。有趣的是虽然主人是好朋友，但是奶茶和riceball的关系并不是很好，他俩不能在一个房间，听说他俩会打架打出粑粑......            Riceball是一只没有绝育的布偶小公猫，跟人特别特别亲，蛮喜欢叫的。跟他玩的时候只要企图把手伸过去，他直接就嗷嗷嗷叫然后翻着肚皮让我去摸他。摸着摸着他就会很爽然后有可能突然给我来一口。Riceball和家里的其他猫关系不好不坏，不会玩在一起，不过也不会打架。


"""
    },
    "Rocket": {
        "en": """
<b>Rocket</b> hi.
""",
        "zh": """
<b>Rocket</b>是和Bubble八宝在一个屋檐下长大的好兄弟。Rocket是领养的，Bubble是买的。他们俩感情可好了，经常能看到互相舔毛，不像家里的俩猛男凑太近就互哈。
            Rocket和Bubble相比更加活泼。他经常鬼鬼祟祟的不知道想干些什么坏事儿，要么在冰箱上，要么在桌子上准备把手伸进杯子里。Rocket的左眼总是流眼泪，所以哪只眼睛眼屎特别多。
            听他们的主人说，Rocket小时候喝水少尿闭过，现在的他特别喜欢玩水，一边玩一边喝，主人表示很欣慰。听说Rocket以前总是干坏事儿，把公寓的地毯都抓了个稀烂哈哈哈，还好我家没什么地毯给他抓。
"""
    },
    "Sophie": {
        "en": """
<b>Sophie</b> hi.
""",
        "zh": """
<b>Sophie</b> 是我Rover上接的第一个单子。当时她的主人周末要出门，所以让我帮忙上门喂喂她。其实也就出门两天，每天都要我去给她开一个罐头和加水。
            她们家的那个小区遍地都是小猫，不过看着像是散养的，每一只都膀大腰粗。真的不夸张，停车场就能看到6只。Sophie的爸妈是年轻的白人夫妇，他们跟我说我去的时候可以把Sophie放露台玩一会儿，呼吸呼吸新鲜空气，还说Sophie肯定不会逃跑的。这个倒是奇特的要求，他们也是真不怕Sophie逃跑呀。
            搜飞在家的时候很喜欢玩一个小球球，还会巡回，我给他扔到二楼她就扑通扑通跑上去捡来给我。
"""
    },
    "Tobi": {
        "en": """
<b>Tobi</b> hi.
""",
        "zh": """
<b>Tobi</b>金渐层是家里的弟弟！姐姐是Gigi。相比之下Tobi憨憨的，更没心没肺一点。两只小宝贝还在猫包里车都没下的时候就开始咕噜咕噜了，性格真的超级无敌好。
            他们的主人刚刚从亚特兰大搬到洛杉矶，还在搬家，所以这个期间Tobi和Gigi就拜托我照顾啦！他们两个每天早晚一个罐头，干粮就是自助餐。Tobi来的时候正好赶上他吐毛球，一开始还以为是姐姐Gigi吐的，后来发现是Tobi。
            Tobi肚子里的毛球还真不少，年纪小小的吃了这么多毛！好在都在我这边吐干净了，然后还有时间吃南瓜泥和益生菌调理了一下，回去就活蹦乱跳了。

"""
    },
    "Tora": {
        "en": """
<b>Tora</b> hi.
""",
        "zh": """
<b>Tora</b>是我目前带过最久的一只猫猫，算起来有5个月了。她是Noel麻麻介绍过来的客户，好像是因为小主人要去别的地方上学一个学期，所以要把Tora托付给我几个月。小拖拉是一只完美小猫，肠胃很硬，在我家经常偷吃别的小猫的猫粮然后从来没有拉肚子过。
            作为高贵的缅因猫，Tora一点儿也不娇贵。她可以跟所有小动物和谐相处，也从来不怕别的小狗。Tora很聪明很聪明，像一只小狗，叫她一声她会答应一声。Tora也很粘人，睡觉的时候喜欢趴在我头上给我舔毛，然后在我额头踩奶。真的好怀念她在我头上大爪子捂着我眼睛睡觉的日子。
            虽然Tora看着凶凶的，但是是一只不折不扣的甜妹。如果我出去一天晚上回到家她会用她沙哑的声音骂骂咧咧的出来狂蹭我QAQ告诉我她想死我了！
            当然了，作为一只长毛猫，Tora不负众望的掉毛。躺过之处必留毛团，嘎吱窝也经常有特别难梳顺的毛结。每次帮她梳毛的时候都得薅好一会儿。

"""
    },
    "丸丸": {
        "en": """
<b>丸丸</b> hi.
""",
        "zh": """
<b>丸丸</b> 是一只我要上门喂养的猫猫，他有一个妹妹米米！丸丸比较不怕生，我每次去基本上都会出来迎接我。
            他们主人出差之前一直都是定时定量，不过出差的时候就是自助餐了。每次我去都挺离谱的，四个碗都干净地见底。我的任务就是给他俩开罐头+铲屎+加猫砂+加水+加饭。丸丸可能是太能吃了，自助餐之后第一次见他和最后一次见他的变化有点大，大了好多圈哈哈哈啊哈。感觉如果一直加他能一直吃。
            有个小插曲就是有一次他们主人的朋友去看他们发现找不到丸丸了！结果这个小登其实把自己藏在了盖着沙发的毯子底下睡大觉。把大家都吓死了。

"""
    },
    "多多": {
        "en": """
<b>多多</b> hi.
""",
        "zh": """
<b>多多</b> hi
"""
    },
    "奶茶": {
        "en": """
<b>奶茶</b> hi.
""",
        "zh": """
<b>奶茶</b> 是阿比星人！早就闻名阿比西尼亚猫猫的粘人，没想到寄养开张没多久就接到了啊啊啊啊很激动很激动。奶茶是一只好好宝宝，我每次把手一伸她就咕噜咕噜蹭过来，疯狂蹭，都要把我蹭秃噜了。
            奶茶是猫咪王国里面最捧我场的小朋友，我做的猫饭她特别爱吃，每次给多少吃多少，吃完还要舔舔碗。我家的逆子闻一闻就走了，根本不爱吃！还是女孩儿贴心。奶茶还爱吃各种稀奇古怪的零食，之前入了一款鹌鹑冻干和小鱼干，全家上下就只有奶茶吃。
            奶茶的小主人说奶茶以前有一只同胞姐姐，她俩形影不离玩可好了。可是有一天姐姐遛出门被车撞了.....就再也没回来了。我以为奶茶一只就和别的猫猫合不来，原来是因为姐姐离开创伤症才这样的QAQ。


"""
    },
    "小七": {
        "en": """
<b>小七</b> hi.
""",
        "zh": """
<b>小七</b>是哥哥猫，很活泼and会找人玩～感觉他特别操心，经常看到他在猫砂盆拨来拨去帮妹妹福来埋粑粑。他是一只很馋的小猫，听说如果在家不收好零食，他会把包装都撕开然后猛吃。
            小七在我房间最喜欢的位置是收纳柜的最顶上，经常找不到他的时候，爬上去看一眼总能看到他在那里。小七对他的妹妹特别特别好，他们俩有给我一种相依为命的感觉。形影不离。睡觉窝在一起睡，舔毛贴在一起舔。

"""
    },
    "小佐": {
        "en": """
<b>小佐</b> hi.
""",
        "zh": """
<b>小佐</b> 是一只还没有绝育的几个月大的长毛三花妹妹，她叫小佐是因为下巴底下有个黑圈圈，她主人说很像日本大佐哈哈哈哈。叫大佐又太狂野了，所以叫小佐好了。
            一开始我在xhs上刷到她们的主人卖猫碗，我正好需要，就联系了！后来她们的主人要回国，发现我也做寄养，所以就拜托我照顾她们一个月啦～小佐在我这里的时候突然开始发情了，因为家里的都是男孩儿，我没有经验，看到她一直在地上抽抽，走也走不动，我吓坏了！不过后来网上一搜，说是发情了，我就放心了。她偶尔这样持续了两天就好了。

"""
    },
    "小鱼": {
        "en": """
<b>小鱼</b> hi.
""",
        "zh": """
<b>小鱼</b> hi
"""
    },
    "巴士": {
        "en": """
<b>巴士</b> hi.
""",
        "zh": """
<b>巴士</b> hi
"""
    },
    "布丁2": {
        "en": """
<b>布丁2</b> hi.
""",
        "zh": """
<b>布丁2</b> hi
"""
    },
    "弟弟": {
        "en": """
<b>弟弟</b> hi.
""",
        "zh": """
<b>弟弟</b> hi
"""
    },
    "挖泥": {
        "en": """
<b>挖泥</b> hi.
""",
        "zh": """
<b>挖泥</b> 是家里的大姐姐，主要的任务是带着二妹挖泥孤立小妹小佐！挖泥是一辆小坦克，招牌动作是揣着小手手，眯眯眼，然后打盹。
            挖泥是那种手都没伸过去就开始翻肚皮扭呀扭呀扭的小猫咪，她特别喜欢别人摸它。她们仨可幸福了，是全冻干主食粮食，牛肉鸡肉鱼肉每天混着吃。每次倒冻干我都觉得特别香，然后Tora就会闻到香味过来偷吃一两口哈哈哈哈。
            小挖泥是这三只里面最喜欢争宠的，如果我摸别的两只的话，她会屁颠屁颠跑过来然后翻出肚皮开扭，暗示我摸她摸她。
"""
    },
    "旮豆": {
        "en": """
<b>旮豆</b> hi.
""",
        "zh": """
<b>旮豆</b> 是一只金色英短，上有姐姐挖泥下有妹妹小佐。她的眼睛特别圆特别大，看起来可怜兮兮的，每天都很无辜。她的标志性动作是伸懒腰，特别喜欢两只小jio放前面，屁股翘老高地伸懒腰。
            旮豆喜欢和姐姐挖泥孤立妹妹小佐！不提倡但是也没办法哈哈哈，也不知道为什么，可能是她俩颜色一样？每次都是旮豆挖泥呆在一块，小佐自己跟自己玩。有时候恶劣一点就是小佐不小心路过她们，她俩会哈小佐。他们三只活宝来了一个月，走的时候房间空荡荡的，怪想念的。


"""
    },
    "柚柚": {
        "en": """
<b>柚柚</b> hi.
""",
        "zh": """
<b>柚柚</b> hi
"""
    },
    "牛牛": {
        "en": """
<b>牛牛</b> hi.
""",
        "zh": """
<b>牛牛</b> 是豆豆异父异母的弟弟，他简直就是Gogo的翻版！和小时候的Gogo是一摸一样。因为牛牛还是小baby，活力特别旺盛，经常上蹿下跳，豆豆经常嫌他烦人然后哈他哈哈哈哈。
            牛牛还在长身体，可是哥哥豆豆又是那种有多少吃多少的猫猫，所以牛牛经常吃不饱。每天都要给牛牛加餐，盯着他吃完才行，不然一走开豆豆就都吃光了。
 牛牛真的就是一个小社牛，来的一个月里成为了Tora姐姐的小跟屁虫。
            Tora去哪里他就跟到哪里，经常会看到猫树上长了两只猫。他们来的时候还带了一颗大大的猫树，和若干个猫抓板，真的是很贴心了。

"""
    },
    "皮皮": {
        "en": """
<b>皮皮</b> hi.
""",
        "zh": """
<b>皮皮</b>是一只大奶牛猫，她的爸爸妈妈很有爱心，经常foster别的小猫咪。皮皮应该也是他们领养的。大皮皮是社交大王，来到新环境直接就和好猫友玩到了一起。
            皮皮是一只馋鬼，喂什么吃什么，吃嘛嘛香。他每天要开一个罐头然后猫粮是自助。皮皮很喜欢被拍屁股，虽然他是一只公猫，但是每次拍屁股他都翘老高要我一直拍一直拍。皮皮的大黑尾巴也是格外的长，几乎跟他的身体一样长。
            皮皮已经来我这边两次啦！他的主人经常从Ontario飞去出差，所以皮皮都会顺路被放在我这里。

"""
    },
    "福来": {
        "en": """
<b>福来</b> hi.
""",
        "zh": """
<b>福来</b>来自一个三宠家庭，有哥哥田园小七，和姐姐博美麻薯。福来刚来的时候很胆小，喜欢躲在阴暗的角落。不过第三天就好多了，直接出来蹭我。她是一只小馋鬼，其实他们一家都是馋鬼，零食不能放在他们能够到的地方，不然全部都会撕开吃光。
            福来和哥哥小七特别特别要好，好到互相舔毛那种，每次看他俩都是形影不离的。他们都是主人在国内家里院子里捡到的，很有爱心！然后不怕麻烦带来这边，然后这次也是要马上带回国。走的时候估计是因为感知到要长途旅行了，最后一天开始小窜了一下。不过好在上飞机之前吃喝拉撒都正常了。

"""
    },
    "米浆": {
        "en": """
<b>米浆</b> hi.
""",
        "zh": """
<b>米浆</b> hi
"""
    },
    "米米": {
        "en": """
<b>米米</b> hi.
""",
        "zh": """
<b>米米</b> 米米奶牛猫是是丸丸的好室友，她胆子相对比较小。第一次上门的时候根本看不见她，要么躲在柜子底下要么把自己藏在被子底下。
            后来去多了几次之后，米米开始熟悉我了，喂饭的时候会跑过来等着。然后喂猫条也愿意出来了。每次我去的时候他们的四个碗都是精光的，所以估计他俩那会儿都超级饿。然后一盛好饭他们两个就排排坐开吃。从上往下看真的好可爱，两个圆墩墩的干饭机器。

"""
    },
    "蛋黄": {
        "en": """
<b>蛋黄</b> hi.
""",
        "zh": """
<b>蛋黄</b> hi
"""
    },
    "豆豆": {
        "en": """
<b>豆豆</b> hi.
""",
        "zh": """
<b>豆豆</b> 豆豆是一只圆圆的英短蓝猫，跟他一起来的是小弟弟暹罗牛牛。豆豆和别的蓝猫一样，性格很敏感，刚到新环境拉了几天稀，然后也是闷闷不乐的。
            他是那种给多少吃多少会一直一直吃把自己吃撑的小猫，所以他们家都是用的喂食器。不过他弟弟总是吃不饱，豆豆会把牛牛挤开，吃牛牛的饭，所以要经常偷偷给牛牛加餐。
            豆豆走的时候看起来都不认识自己的爸妈了哈哈哈，死活不愿意进猫包，然后还到处乱窜。回家又是拉了好几天稀，蔫了几天。

"""
    },
}

DEFAULT_STORY = "*This dog's story is still being written. Stay tuned!*"

def get_story(name: str) -> str:
    return CAT_STORIES.get((name or "").lower(), DEFAULT_STORY)
